thiemar/vectorcontrol/src/stm32f302_hal.cpp
/*
Copyright (c) 2014 - 2015 by Thiemar Pty Ltd

This file is part of vectorcontrol.

vectorcontrol is free software: you can redistribute it and/or modify it under
the terms of the GNU General Public License as published by the Free Software
Foundation, either version 3 of the License, or (at your option) any later
version.

vectorcontrol is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with
vectorcontrol. If not, see <http://www.gnu.org/licenses/>.
*/

#include <cstdlib>
#include <cstdint>
#include <cassert>
#include "stm32f30x.h"
#include "hal.h"
#include "svm.h"
#include "perf.h"


/*
ESC revision 2 board pin definitions - STM32F302

PIN   PORT   NUMBER    FUNCTION
  1      -        -    VDD1
  2      F        0    OSC_IN
  3      F        1    -
  4      -        -    NRST - debug access
  5      -        -    VDDA
  6      -        -    VSSA
  7      A        0    ADC1_IN1 - Phase A current sense
  8      A        1    ADC1_IN2 - Phase B current sense
  9      A        2    ADC1_IN3 - Phase C current sense
 10      A        3    ADC1_IN4 - VSENSE
 11      A        4    ADC1_IN5 - TSENSE
 12      A        5    -
 13      A        6    -
 14      A        7    -
 15      B        0    -
 16      -        -    VSS2
 17      -        -    VDD2
 18      A        8    TIM1_CH1 - Phase A PWM
 19      A        9    TIM1_CH2 - Phase B PWM
 20      A       10    TIM1_CH3 - Phase C PWM
 21      A       11    CAN_RX
 22      A       12    CAN_TX
 23      A       13    SWDIO - debug access
 24      A       14    SWCLK - debug access
 25      A       15    -
 26      B        3    TRACESWO - debug access
 27      B        4    -
 28      B        5    -
 29      B        6    /CAN_SILENT
 30      B        7    -
 31      -        -    BOOT0
 32      -        -    VSS1
*/

/* These two are externally useful */
extern const uint32_t hal_core_frequency_hz = 72000000u;
extern const uint32_t hal_pwm_frequency_hz = 62500u;

const uint32_t hal_adc_frequency_hz = hal_core_frequency_hz;

const uint32_t hal_pwm_period_ticks = hal_core_frequency_hz /
                                      hal_pwm_frequency_hz;
const uint32_t hal_pwm_half_period_ticks = hal_pwm_period_ticks / 2;
const uint32_t hal_pwm_quarter_period_ticks = hal_pwm_period_ticks / 4;


/*
Set the TIM1 update event rate based on the selected PWM frequency. Must
always be odd; 1 results in an update event every PWM cycle, and 3 results
in an update event every 2 PWM cycles.
*/
const uint32_t hal_pwm_control_rate_div =
    hal_pwm_frequency_hz < 40000 ? 1u : 3u;


/* Work out the ADC sampling time in nanoseconds */
const float hal_adc_sample_periods = 7.5f;
const float hal_adc_sample_time_ns =
    1e3f * (3.0f * hal_adc_sample_periods + 2.0f * 13.5f) /
    hal_adc_frequency_hz;
const float hal_adc_shunt_settling_time_ns = 200.0f;
const uint32_t hal_adc_sample_time_ticks =
    (uint32_t)(hal_adc_sample_time_ns * hal_core_frequency_hz * 1e-9f + 0.5f);
const uint32_t hal_adc_settling_time_ticks =
    (uint32_t)(hal_adc_shunt_settling_time_ns *
               hal_core_frequency_hz * 1e-9f + 0.5f);


/* Board parameters */
const float hal_nominal_mcu_vdd_v = 3.3f;
const float hal_current_sense_gain_v_per_v = 20.0f;
const float hal_current_sense_r = 0.001f;
const float hal_vbus_gain_v_per_v = 1.0f / (20.0f + 1.0f);
const uint32_t hal_adc_full_scale_lsb = 1u << 12u;
const float hal_adc_v_per_lsb =
    hal_nominal_mcu_vdd_v / (float)hal_adc_full_scale_lsb;


/* This is a signed quantity so can go +/- 1.65 V of the 1.65 V reference */
extern const float hal_full_scale_current_a =
    0.5f * hal_adc_v_per_lsb * (float)hal_adc_full_scale_lsb /
    (hal_current_sense_r * hal_current_sense_gain_v_per_v);
/* Vbus input is 0-3.3 V */
extern const float hal_full_scale_voltage_v =
    hal_adc_v_per_lsb * (float)hal_adc_full_scale_lsb / hal_vbus_gain_v_per_v;

/* Control timestemp in seconds */
extern const float hal_control_t_s =
    (float)((1 + hal_pwm_control_rate_div) / 2) / (float)hal_pwm_frequency_hz;


#define HAL_ADC_PHASE_A_CHANNEL 1u
#define HAL_ADC_PHASE_B_CHANNEL 2u
#define HAL_ADC_PHASE_C_CHANNEL 3u
#define HAL_ADC_VBUS_CHANNEL 4u


/* CAN bit rate in bits per second */
#define HAL_CAN_RATE_BPS 1000000u


/*
Minimum number of core cycles for a pulse on CAN RX to be considered a PWM
pulse, rather than part of a CAN message -- corresponds to 10 us.
*/
#define HAL_PWM_MIN_CYCLES 720u


/* Interrupt priorities */
#define ADC_PRE_EMPTION_PRIORITY 1u
#define ADC_SUB_PRIORITY 0u

#define CAN_RX_PRE_EMPTION_PRIORITY 2u
#define CAN_RX_SUB_PRIORITY 0u

#define SYSTICK_PRE_EMPTION_PRIORITY 3u
#define SYSTICK_SUB_PRIORITY 0u

/* Do not modify (NVIC_PriorityGroup_3 is assumed to be set) */
#define SYSTICK_PRIORITY (((SYSTICK_PRE_EMPTION_PRIORITY & 0x07) << 1) | \
                          (SYSTICK_SUB_PRIORITY & 0x01))


/*
Phase A/B/C MOSFET driver switch from TIM1. Output, alternate function |
tri-state depending on enable mode.
H = top switch on
L = bottom switch on
Z = both switches off
*/
#define PORT_PHASE_SW GPIOA
static GPIO_InitTypeDef PIN_PHASE_SW_EN = {
    GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10,
    GPIO_Mode_AF,
    GPIO_Speed_Level_3,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};
static GPIO_InitTypeDef PIN_PHASE_SW_DIS = {
    GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10,
    GPIO_Mode_IN,
    GPIO_Speed_Level_3,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};
static GPIO_InitTypeDef PIN_PHASE_SW_LOW = {
    GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10,
    GPIO_Mode_OUT,
    GPIO_Speed_Level_3,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


/* ADC inputs, analog, 0–3.3 V. */
#define PORT_ADC GPIOA
static GPIO_InitTypeDef PIN_ADC = {
    GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3,
    GPIO_Mode_AN,
    GPIO_Speed_Level_3,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


/* DAC output for ADC voltage reference, 1.65 V */
#define PORT_DAC GPIOA
static GPIO_InitTypeDef PIN_DAC = {
    GPIO_Pin_4,
    GPIO_Mode_AN,
    GPIO_Speed_Level_3,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


/* CAN RX from transceiver. Input, digital. */
#define PORT_CAN_RX GPIOA
static GPIO_InitTypeDef PIN_CAN_RX = {
    GPIO_Pin_11,
    GPIO_Mode_AF,
    GPIO_Speed_Level_2,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


/* CAN TX to transceiver. Output, alternate function. */
#define PORT_CAN_TX GPIOA
static GPIO_InitTypeDef PIN_CAN_TX = {
    GPIO_Pin_12,
    GPIO_Mode_AF,
    GPIO_Speed_Level_2,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


