thiemar/vectorcontrol/src/stm32f302_hal.cpp
/*
CAN SILENT signal to transceiver. Output, push-pull.
H = CAN transceiver is in silent mode (forced recessive)
L = CAN transceiver is in normal mode
*/
#define PORT_CAN_SILENT GPIOB
static GPIO_InitTypeDef PIN_CAN_SILENT = {
    GPIO_Pin_6,
    GPIO_Mode_OUT,
    GPIO_Speed_Level_1,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


/* PWM input -- tied to CAN RX but times pulse widths to detect PWM signals */
#define PORT_PWM_INPUT GPIOA
static GPIO_InitTypeDef PIN_PWM_INPUT = {
    GPIO_Pin_15,
    GPIO_Mode_AF,
    GPIO_Speed_Level_1,
    GPIO_OType_PP,
    GPIO_PuPd_NOPULL
};


/* Hardware states */
static volatile enum hal_pwm_state_t pwm_state_;


/* Low-frequency (SysTick) control task callback */
static volatile hal_callback_t low_frequency_task_;
/* High-frequency (ADC update) control task callback */
static volatile hal_control_callback_t high_frequency_task_;
/* CAN message RX callback */
static volatile hal_can_callback_t can_receive_task_;
/* PWM pulse callback */
static volatile hal_pwm_callback_t pwm_receive_task_;


/* ADC conversion result destination */
static volatile uint16_t adc_conversion_results_[2];


/* Vbus in raw ADC units (1/LSB) */
static uint32_t board_vbus_lsb_;
static volatile float vbus_v_;
static volatile float vbus_inv_;


/* Board temperature in raw ADC units (1/LSB) */
static uint32_t board_temp_lsb_;
static volatile float temp_degc_;


extern "C" void SysTick_Handler(void);
extern "C" void ADC1_2_IRQHandler(void);
extern "C" void USB_LP_CAN1_RX0_IRQHandler(void);
extern "C" void CAN1_RX1_IRQHandler(void);
extern "C" void Fault_Handler(void);


static void hal_init_sys_();
static void hal_init_io_();
static void hal_init_tim1_();
static void hal_init_adc_();
static void hal_init_dma_();
static void hal_init_can_();
static void hal_run_calibration_();
static bool hal_read_last_vbus_temp_();


inline void __attribute__((optimize("O3")))
hal_read_phase_shunts_(
    int16_t phase_shunt_signal_lsb[3],
    uint8_t phase_pwm_sector
) {
    /* Direct reading of phase A current */
    phase_shunt_signal_lsb[0] = (int16_t)ADC1->JDR1;

    /* Direct reading of phase B current */
    phase_shunt_signal_lsb[1] = (int16_t)ADC1->JDR2;

    /* Direct reading of phase C current */
    phase_shunt_signal_lsb[2] = (int16_t)ADC1->JDR3;

    switch (phase_pwm_sector) {
        case 4:
        case 5:
            /*
            A and B are observable, no need to reconstruct C as it's not used
            */
            break;

        case 6:
        case 1:
            /*
            Phase A current is not observable -- reconstruct:
            IA = -IC - IB
            */
            phase_shunt_signal_lsb[0] = (int16_t)(-phase_shunt_signal_lsb[2] -
                                                   phase_shunt_signal_lsb[1]);
            break;

        case 2:
        case 3:
            /*
            Phase B current is not observable -- reconstruct:
            IB = -IC - IA
            */
            phase_shunt_signal_lsb[1] = (int16_t)(-phase_shunt_signal_lsb[2] -
                                                   phase_shunt_signal_lsb[0]);
            break;

        default:
            break;
    }
}


inline void __attribute__((optimize("O3")))
hal_update_timer_(
    uint8_t phase_pwm_sector,
    const uint16_t phase_on_ticks[3]
) {
    const uint8_t sector_phases[6][3] = {
        /* primary, secondary, tertiary */
        { 0, 1, 2 },
        { 1, 0, 2 },
        { 1, 2, 0 },
        { 2, 1, 0 },
        { 2, 0, 1 },
        { 0, 2, 1 }
    };
    uint16_t sample_ticks, duty_delta_ticks, phase1_ticks, phase2_ticks,
             period_ticks;

    phase1_ticks = phase_on_ticks[sector_phases[phase_pwm_sector - 1][0]];
    phase2_ticks = phase_on_ticks[sector_phases[phase_pwm_sector - 1][1]];
    period_ticks = hal_pwm_half_period_ticks - 1u;

    /* Polarity of CC4 is active high */
    TIM1->CCER &= 0xDFFFu;

    if ((uint16_t)(period_ticks - phase1_ticks) >
            hal_adc_settling_time_ticks) {
        sample_ticks = (uint16_t)(period_ticks - 1u);
    } else {
        duty_delta_ticks = (uint16_t)(phase1_ticks - phase2_ticks);
        sample_ticks = (uint16_t)phase1_ticks;

        /* Check which side of the crossing point we should sample */
        if (duty_delta_ticks > (uint16_t)(period_ticks - phase1_ticks) * 2u) {
            sample_ticks =
                (uint16_t)(sample_ticks - hal_adc_sample_time_ticks);
        } else {
            sample_ticks =
                (uint16_t)(sample_ticks + hal_adc_settling_time_ticks);

            if (sample_ticks >= period_ticks) {
                /* Make polarity of CC4 active low */
                TIM1->CCER |= 0x2000u;

                sample_ticks =
                    (uint16_t)((2u * period_ticks) - sample_ticks - 1u);
            }
        }
    }

    /*
    Update the on times for the PWM channels as well as the ADC trigger point
    */
    TIM1->CCR1 = phase_on_ticks[0];
    TIM1->CCR2 = phase_on_ticks[1];
    TIM1->CCR3 = phase_on_ticks[2];
    TIM1->CCR4 = sample_ticks;
}


void
__attribute__((noreturn))
__esc_assert_func (
    const char __attribute__((unused)) *file,
    int __attribute__((unused)) line,
    const char __attribute__((unused)) *func,
    const char __attribute__((unused)) *failedexpr
) {
    hal_set_pwm_state(HAL_PWM_STATE_OFF);
    abort();
}


void Fault_Handler(void) {
    esc_assert(false);
}


void NMIVector(void) __attribute__((alias("Fault_Handler")));
void HardFaultVector(void) __attribute__((alias("Fault_Handler")));
void MemManageVector(void) __attribute__((alias("Fault_Handler")));
void BusFaultVector(void) __attribute__((alias("Fault_Handler")));
void UsageFaultVector(void) __attribute__((alias("Fault_Handler")));


void SysTick_Handler(void) {
    /*
    Get the latest bus voltage or temperature, depending on what was requested
    */
    hal_read_last_vbus_temp_();

    /* If we got a PWM pulse, call the PWM receive callback. */
    if (TIM2->SR & TIM_SR_CC2IF) {
        if (pwm_receive_task_) {
            pwm_receive_task_(TIM2->CCR2, TIM2->CCR1);
        }

        TIM2->SR &= ~(TIM_SR_CC2IF | TIM_SR_CC1IF);
    }

