thiemar/vectorcontrol/src/stm32f302_hal.cpp
    /* Run the user task, if defined */
    if (low_frequency_task_) {
        low_frequency_task_();
    }
}


void __attribute__((optimize("O3")))
ADC1_2_IRQHandler(void) {
PERF_COUNT_START
    static float last_v_ab[2];
    static float prev_v_ab[2];
    static uint8_t last_pwm_sector = 1u;
    static uint8_t prev_pwm_sector = 1u;

    int16_t phase_current_lsb[3];
    uint16_t phase_oc[3];
    float out_v_ab[2], i_ab[2];
    float temp;

    /* Clear TIM1 update flag so failure to meet deadline can be detected */
    TIM1->SR &= ~(uint16_t)TIM_FLAG_Update;

    hal_read_phase_shunts_(phase_current_lsb, prev_pwm_sector);

    /*
    Clarke transformation for balanced systems

    i_alpha = i_a,
    i_beta = (2 * i_b + i_a) / sqrt(3)

    Multiply by 8 because the phase current readings are right-aligned.
    */
    i_ab[0] = (float)phase_current_lsb[0] *
              (hal_full_scale_current_a * 8.0f / 32768.0f);
    temp = (float)phase_current_lsb[1] *
           (hal_full_scale_current_a * 8.0f / 32768.0f);
    i_ab[1] = (0.57735026919f * i_ab[0] + 1.15470053838f * temp);

    if (high_frequency_task_) {
        high_frequency_task_(out_v_ab, prev_v_ab, i_ab, vbus_v_);
    } else {
        out_v_ab[0] = out_v_ab[1] = 0.0f;
    }

    prev_v_ab[0] = last_v_ab[0];
    prev_v_ab[1] = last_v_ab[1];

    last_v_ab[0] = out_v_ab[0];
    last_v_ab[1] = out_v_ab[1];

    prev_pwm_sector = last_pwm_sector;

    /*
    Convert alpha-beta frame voltage fractions to SVM output compare values
    for each phase.
    */
    last_pwm_sector = svm_duty_cycle_from_v_alpha_beta(
        phase_oc,
        (int16_t)__SSAT((int32_t)(vbus_inv_ * out_v_ab[0]), 16),
        (int16_t)__SSAT((int32_t)(vbus_inv_ * out_v_ab[1]), 16),
        hal_pwm_period_ticks);

    /* Update the timer */
    hal_update_timer_(last_pwm_sector, phase_oc);

    /*
    Clear the JEOS event, and prepare for the next hardware trigger
    ADC_ClearFlag(ADC1, ADC_FLAG_JEOS);
    */
    ADC1->ISR = ADC_FLAG_JEOS;
    /*
    Allow the next ADC conversion to happen based on the TIM1 CC4 event
    ADC_StartInjectedConversion(ADC1);
    */
    ADC1->CR |= ADC_CR_JADSTART;

    /* FIXME -- check return code for task deadline miss */
PERF_COUNT_END
}


void USB_LP_CAN1_RX0_IRQHandler(void) {
    uint8_t num_messages, i;
    CANMessage message;
    CanRxMsg rx_message;

    num_messages = CAN_MessagePending(CAN1, 0);
    for (i = 0; i < num_messages; i++) {
        CAN_Receive(CAN1, 0, &rx_message);
        message.set_id(rx_message.IDE == CAN_Id_Standard ?
                       rx_message.StdId : rx_message.ExtId);
        message.set_data(rx_message.DLC, rx_message.Data);
        if (can_receive_task_) {
            can_receive_task_(message);
        }
    }
}


void CAN1_RX1_IRQHandler(void) {
    uint8_t num_messages, i;
    CANMessage message;
    CanRxMsg rx_message;

    num_messages = CAN_MessagePending(CAN1, 1);
    for (i = 0; i < num_messages; i++) {
        CAN_Receive(CAN1, 1, &rx_message);
        message.set_id(rx_message.IDE == CAN_Id_Standard ?
                       rx_message.StdId : rx_message.ExtId);
        message.set_data(rx_message.DLC, rx_message.Data);
            if (can_receive_task_) {
            can_receive_task_(message);
        }
    }
}


static void hal_init_sys_() {
    /* Enable the required peripherals */
    RCC_ADCCLKConfig(RCC_ADC12PLLCLK_Div1);

    /* AHB */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ADC12, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);

    /* APB2 peripherals (high-speed) */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);

    /* APB1 peripherals (low-speed) */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    /* Configure the interrupt controller */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_3);

    /* Enable DWT count-down */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}


static void hal_init_io_() {
    /* Reset I/O ports */
    GPIO_DeInit(GPIOA);
    GPIO_DeInit(GPIOB);

    /* Turn CAN to silent to avoid glitches */
    GPIO_SetBits(PORT_CAN_SILENT, (uint16_t)PIN_CAN_SILENT.GPIO_Pin);

    /*
    Don't lock GPIO config for these as we need to switch between tri-state
    and alternate function push-pull depending on drive status.
    */
    GPIO_Init(PORT_PHASE_SW, &PIN_PHASE_SW_DIS);

    /* Configure TIM1 alternate function remaps for PWM out */
    GPIO_PinAFConfig(PORT_PHASE_SW, GPIO_PinSource8, GPIO_AF_6);
    GPIO_PinAFConfig(PORT_PHASE_SW, GPIO_PinSource9, GPIO_AF_6);
    GPIO_PinAFConfig(PORT_PHASE_SW, GPIO_PinSource10, GPIO_AF_6);

    GPIO_Init(PORT_ADC, &PIN_ADC);
    GPIO_PinLockConfig(PORT_ADC, (uint16_t)PIN_ADC.GPIO_Pin);

    GPIO_Init(PORT_DAC, &PIN_DAC);
    GPIO_PinLockConfig(PORT_DAC, (uint16_t)PIN_DAC.GPIO_Pin);

    GPIO_Init(PORT_CAN_SILENT, &PIN_CAN_SILENT);
    GPIO_PinLockConfig(PORT_CAN_SILENT, (uint16_t)PIN_CAN_SILENT.GPIO_Pin);

    /* Configure CAN alternate function */
    GPIO_PinAFConfig(PORT_CAN_RX, GPIO_PinSource11, GPIO_AF_9);
    GPIO_PinAFConfig(PORT_CAN_TX, GPIO_PinSource12, GPIO_AF_9);

    GPIO_Init(PORT_CAN_TX, &PIN_CAN_TX);
    GPIO_Init(PORT_CAN_RX, &PIN_CAN_RX);
    GPIO_PinLockConfig(PORT_CAN_TX, (uint16_t)(PIN_CAN_TX.GPIO_Pin |
                                               PIN_CAN_RX.GPIO_Pin));

    /* Turn CAN on */
    GPIO_ResetBits(PORT_CAN_SILENT, (uint16_t)PIN_CAN_SILENT.GPIO_Pin);

    /* Configure PWM alternate function -- TIM2_CH1 */
    GPIO_PinAFConfig(PORT_PWM_INPUT, GPIO_PinSource15, GPIO_AF_1);
    GPIO_Init(PORT_PWM_INPUT, &PIN_PWM_INPUT);
    GPIO_PinLockConfig(PORT_PWM_INPUT, (uint16_t)PIN_PWM_INPUT.GPIO_Pin);
}


static void hal_init_tim1_() {
    TIM_TimeBaseInitTypeDef timebase_config = {
        .TIM_Prescaler = 0,
        .TIM_CounterMode = TIM_CounterMode_CenterAligned1,
        .TIM_Period = (uint16_t)(hal_pwm_half_period_ticks - 1u),
        .TIM_ClockDivision = TIM_CKD_DIV2,
        .TIM_RepetitionCounter = hal_pwm_control_rate_div
    };
    TIM_OCInitTypeDef oc_config = {
        .TIM_OCMode = TIM_OCMode_PWM1,
        .TIM_OutputState = TIM_OutputState_Enable,
        .TIM_OutputNState = TIM_OutputNState_Disable,
        .TIM_Pulse = (uint16_t)hal_pwm_quarter_period_ticks,
        .TIM_OCPolarity = TIM_OCPolarity_High,
        .TIM_OCNPolarity = TIM_OCNPolarity_High,
        .TIM_OCIdleState = TIM_OCIdleState_Reset,
        .TIM_OCNIdleState = TIM_OCNIdleState_Reset
    };
    TIM_BDTRInitTypeDef bdtr_config = {
        .TIM_OSSRState = TIM_OSSRState_Enable,
        .TIM_OSSIState = TIM_OSSIState_Enable,
        .TIM_LOCKLevel = TIM_LOCKLevel_1,
        .TIM_DeadTime = 0u,
        .TIM_Break = TIM_Break_Disable,
        .TIM_BreakPolarity = TIM_BreakPolarity_High,
        .TIM_AutomaticOutput = TIM_AutomaticOutput_Disable
    };

