thiemar/vectorcontrol/src/stm32f302_hal.cpp
    /* Reset TIM1 */
    TIM_DeInit(TIM1);

    /* Configure the timebase and OC channels */
    TIM_TimeBaseInit(TIM1, &timebase_config);

    /* OC1-3 are PWM channels */
    TIM_OC1Init(TIM1, &oc_config);
    TIM_OC2Init(TIM1, &oc_config);
    TIM_OC3Init(TIM1, &oc_config);

    /*
    OC4 is the ADC conversion timer, so configuration is a little different
    */
    oc_config.TIM_OCMode = TIM_OCMode_PWM2;
    oc_config.TIM_Pulse = (uint16_t)(hal_pwm_half_period_ticks - 5u);
    TIM_OC4Init(TIM1, &oc_config);

    /* Enable preload */
    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_OC3PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable);

    /* Dead Time */
    TIM_BDTRConfig(TIM1, &bdtr_config);

    /* Output trigger is update event */
    TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);

    /*
    Enable TIM1 and resynchronize so update event happens during underflow
    */
    TIM_Cmd(TIM1, ENABLE);
    TIM_GenerateEvent(TIM1, TIM_EventSource_Update);

    /* Stop TIM1 when execution is paused */
    DBGMCU_Config(DBGMCU_TIM1_STOP, ENABLE);
}


static void hal_init_pwm_() {
    TIM_TimeBaseInitTypeDef tim2_config = {
        .TIM_Prescaler = 72u - 1u, /* 1 us resolution -- TIM2 is on APB1,
                                      which runs at 36 MHz */
        .TIM_CounterMode = TIM_CounterMode_Up,
        .TIM_Period = 65535u, /* 0.065 s maximum period */
        .TIM_ClockDivision = TIM_CKD_DIV1,
        .TIM_RepetitionCounter = 0
    };
    TIM_ICInitTypeDef capture_config = {
        .TIM_Channel = TIM_Channel_1,
        .TIM_ICPolarity = TIM_ICPolarity_Falling,
        .TIM_ICSelection = TIM_ICSelection_DirectTI,
        .TIM_ICPrescaler = TIM_ICPSC_DIV1,
        .TIM_ICFilter = 0
    };

    TIM_DeInit(TIM2);
    TIM_TimeBaseInit(TIM2, &tim2_config);

    TIM_SelectInputTrigger(TIM2, TIM_TS_TI1FP1);
    TIM_SelectSlaveMode(TIM2, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM2, TIM_MasterSlaveMode_Enable);

    TIM_PWMIConfig(TIM2, &capture_config);

    TIM2->SR &= ~(TIM_SR_CC2IF | TIM_SR_CC1IF);

    TIM_Cmd(TIM2, ENABLE);
}


static void hal_init_adc_() {
    DAC_InitTypeDef dac_config = {
        .DAC_Trigger = DAC_Trigger_None,
        .DAC_WaveGeneration = DAC_WaveGeneration_None,
        .DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bits2_0,
        .DAC_OutputBuffer = DAC_OutputBuffer_Disable
    };
    ADC_InitTypeDef config = {
        .ADC_ContinuousConvMode = ADC_ContinuousConvMode_Disable,
        .ADC_Resolution = ADC_Resolution_12b,
        .ADC_ExternalTrigConvEvent = ADC_ExternalTrigConvEvent_0,
        .ADC_ExternalTrigEventEdge = ADC_ExternalTrigEventEdge_None,
        .ADC_DataAlign = ADC_DataAlign_Right,
        .ADC_OverrunMode = ADC_OverrunMode_Disable,
        .ADC_AutoInjMode = ADC_AutoInjec_Disable,
        .ADC_NbrOfRegChannel = 2u
    };
    ADC_CommonInitTypeDef common_config = {
        .ADC_Mode = ADC_Mode_Independent,
        .ADC_Clock = ADC_Clock_SynClkModeDiv1,
        .ADC_DMAAccessMode = ADC_DMAAccessMode_1,
        .ADC_DMAMode = ADC_DMAMode_OneShot,
        .ADC_TwoSamplingDelay = 0u
    };

    /* Init DAC for the current sense voltage reference (1.65 V) */
    DAC_DeInit();
    DAC_Init(DAC_Channel_1, &dac_config);
    DAC_Cmd(DAC_Channel_1, ENABLE);
    DAC_SetChannel1Data(DAC_Align_12b_R, 0x800u);

    /* Init ADC1 */
    ADC_DeInit(ADC1);
    ADC_VoltageRegulatorCmd(ADC1, ENABLE);

    /* Worst-case regulator delay is 10 us */
    for (volatile uint32_t x = 0;
         x < 10 * hal_core_frequency_hz / 1000000; x++);

    ADC_CommonInit(ADC1, &common_config);
    ADC_Init(ADC1, &config);

    /* Calibrate the ADCs */
    ADC_StartCalibration(ADC1);
    while (ADC_GetCalibrationStatus(ADC1));

    /*
    Delay after calibration done -- see STM32F302x6/x8 Silicon Limitations
    (DM00109012) item 2.2.4.
    */
    for (volatile uint32_t x = 0; x < 4; x++);

    /* Enable the ADC and temperature sensor */
    ADC_Cmd(ADC1, ENABLE);
    ADC_TempSensorCmd(ADC1, ENABLE);

    while (!(ADC1_2->CSR & ADC12_CSR_ADRDY_MST));

    /* Configure VBUS and temperature sense channels */
    ADC_RegularChannelConfig(ADC1, HAL_ADC_VBUS_CHANNEL, 1u,
                             ADC_SampleTime_61Cycles5);
    ADC_RegularChannelConfig(ADC1, ADC_Channel_TempSensor, 2u,
                             ADC_SampleTime_181Cycles5);
}


static void hal_init_dma_() {
    DMA_InitTypeDef ch1_config = {
        .DMA_PeripheralBaseAddr = (uint32_t)&(ADC1->DR),
        .DMA_MemoryBaseAddr = (uint32_t)(&adc_conversion_results_),
        .DMA_DIR = DMA_DIR_PeripheralSRC,
        .DMA_BufferSize = 2u,
        .DMA_PeripheralInc = DMA_PeripheralInc_Disable,
        .DMA_MemoryInc = DMA_MemoryInc_Enable,
        .DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord,
        .DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord,
        .DMA_Mode = DMA_Mode_Circular,
        .DMA_Priority = DMA_Priority_Low,
        .DMA_M2M = DMA_M2M_Disable
    };
    NVIC_InitTypeDef nvic_config = {
        .NVIC_IRQChannel = (uint8_t)ADC1_2_IRQn,
        .NVIC_IRQChannelPreemptionPriority = ADC_PRE_EMPTION_PRIORITY,
        .NVIC_IRQChannelSubPriority = ADC_SUB_PRIORITY,
        .NVIC_IRQChannelCmd = ENABLE
    };

    /*
    DMA channel 1 (temperature and VBUS measurement) is linked to ADC1 end of
    conversion
    */
    DMA_DeInit(DMA1_Channel1);
    DMA_Init(DMA1_Channel1, &ch1_config);
    DMA_Cmd(DMA1_Channel1, ENABLE);
    ADC_DMACmd(ADC1, ENABLE);

    /* Enable ADC interrupts */
    NVIC_Init(&nvic_config);
}


static void hal_init_can_() {
    CAN_InitTypeDef config = {
        .CAN_Prescaler = 0,
        .CAN_Mode = CAN_Mode_Normal, /* Or CAN_Mode_LoopBack */
        .CAN_SJW = 0,
        .CAN_BS1 = 0,
        .CAN_BS2 = 0,
        .CAN_TTCM = DISABLE, /* Enable or disable the time triggered
                                communication mode. */
        .CAN_ABOM = ENABLE,  /* Enable or disable the automatic bus-off
                                management. */
        .CAN_AWUM = ENABLE,  /* Enable or disable the automatic wake-up
                                mode. */
        .CAN_NART = ENABLE,  /* Enable or disable the no-automatic
                                retransmission mode. */
        .CAN_RFLM = DISABLE,  /* Enable or disable the Receive FIFO Locked
                                 mode. */
        .CAN_TXFP = ENABLE    /* Enable or disable the transmit FIFO
                                priority. */
    };
    CAN_FilterInitTypeDef filter_config = {
        .CAN_FilterIdHigh = 0,         /* Specifies the filter identification
                                          number (MSBs for a 32-bit
                                          configuration, first one for a
                                          16-bit configuration). */
        .CAN_FilterIdLow = 0,          /* Specifies the filter identification
                                          number (LSBs for a 32-bit
                                          configuration, second one for a
                                          16-bit configuration). */
        .CAN_FilterMaskIdHigh = 0,     /* Specifies the filter mask number or
                                          identification number, according to
                                          the mode (MSBs for a 32-bit
                                          configuration, first one for a
                                          16-bit configuration). */
        .CAN_FilterMaskIdLow = 0,      /* Specifies the filter mask number or
                                          identification number, according to
                                          the mode (LSBs for a 32-bit
                                          configuration, second one for a
                                          16-bit configuration).*/
        .CAN_FilterFIFOAssignment = 0,
        .CAN_FilterNumber = 0,          /* Specifies the filter which will be
                                           initialized. It ranges from 0 to
                                           13. */
        .CAN_FilterMode = 0,            /* Specifies the filter mode to be
                                           initialized. */
        .CAN_FilterScale = 0,           /* Specifies the filter scale. */
        .CAN_FilterActivation = ENABLE
    };
    NVIC_InitTypeDef nvic_config = {
        .NVIC_IRQChannel = 0,
        .NVIC_IRQChannelPreemptionPriority = CAN_RX_PRE_EMPTION_PRIORITY,
        .NVIC_IRQChannelSubPriority = CAN_RX_SUB_PRIORITY,
        .NVIC_IRQChannelCmd = ENABLE
    };

