thiemar/vectorcontrol/src/stm32f302_hal.cpp
#if (HAL_CAN_RATE_BPS == 1000000)
    /* 1 Mbaud from 72 MHz system clock */
    config.CAN_Prescaler = 4;
    config.CAN_BS1 = 6;
    config.CAN_BS2 = 0;
#elif (HAL_CAN_RATE_BPS == 500000)
    /* 500 Kbaud from 72 MHz system clock */
    config.CAN_Prescaler = 9;
    config.CAN_BS1 = 5;
    config.CAN_BS2 = 0;
#elif (HAL_CAN_RATE_BPS == 250000)
    /* 250 Kbaud from 72 MHz system clock */
    config.CAN_Prescaler = 9;
    config.CAN_BS1 = 12;
    config.CAN_BS2 = 1;
#else
#pragma error("Invalid CAN_RATE_BPS")
#endif

    CAN_DeInit(CAN1);

    CAN_Init(CAN1, &config);
    CAN_FilterInit(&filter_config);

    /* Configure interrupts for both RX FIFOs */
    nvic_config.NVIC_IRQChannel = (uint8_t)USB_LP_CAN1_RX0_IRQn;
    NVIC_Init(&nvic_config);
    CAN_ITConfig(CAN1, CAN_IT_FMP0, ENABLE);

    nvic_config.NVIC_IRQChannel = (uint8_t)CAN1_RX1_IRQn;
    NVIC_Init(&nvic_config);
    CAN_ITConfig(CAN1, CAN_IT_FMP1, ENABLE);
}


static void hal_run_calibration_() {
    ADC_InjectedInitTypeDef injected_config = {
        .ADC_ExternalTrigInjecConvEvent = ADC_ExternalTrigInjecConvEvent_1,
        .ADC_ExternalTrigInjecEventEdge = ADC_ExternalTrigInjecEventEdge_None,
        .ADC_NbrOfInjecChannel = 3u,
        .ADC_InjecSequence1 = HAL_ADC_PHASE_A_CHANNEL,
        .ADC_InjecSequence2 = HAL_ADC_PHASE_B_CHANNEL,
        .ADC_InjecSequence3 = HAL_ADC_PHASE_C_CHANNEL,
        .ADC_InjecSequence4 = 1 /* ADC_InjectedInit requires all four channels
                                   be valid, even if not used */
    };

    size_t i;
    uint32_t offset[3] = {0, 0, 0};

    /* Ensure MOSFETs are turned off before we start */
    hal_set_pwm_state(HAL_PWM_STATE_LOW);

    /* Don't need end-of-conversion interrupts */
    ADC_ITConfig(ADC1, ADC_IT_JEOS, DISABLE);
    ADC_ClearFlag(ADC1, ADC_FLAG_JEOS);

    /* Set up a conversion sequence to read from each of the shunts */
    ADC_InjectedInit(ADC1, &injected_config);

    ADC_InjectedChannelSampleTimeConfig(
        ADC1, HAL_ADC_PHASE_A_CHANNEL, ADC_SampleTime_7Cycles5);
    ADC_InjectedChannelSampleTimeConfig(
        ADC1, HAL_ADC_PHASE_B_CHANNEL, ADC_SampleTime_7Cycles5);
    ADC_InjectedChannelSampleTimeConfig(
        ADC1, HAL_ADC_PHASE_C_CHANNEL, ADC_SampleTime_7Cycles5);

    /* Sample the three shunts 16384 times each (takes ~6 ms) */
    for (i = 0; i < 16384u; i++) {
        ADC_StartInjectedConversion(ADC1);
        while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_JEOS));
        ADC_ClearFlag(ADC1, ADC_FLAG_JEOS);

        offset[0] +=
            ADC_GetInjectedConversionValue(ADC1, ADC_InjectedChannel_1);
        offset[1] +=
            ADC_GetInjectedConversionValue(ADC1, ADC_InjectedChannel_2);
        offset[2] +=
            ADC_GetInjectedConversionValue(ADC1, ADC_InjectedChannel_3);
    }

    /*
    Get the mean shunt offset and set the channels up to subtract that offset
    value from the readings. This makes the output values signed 12-bit packed
    into the LSBs of a 16-bit register, with sign extension.
    */
    ADC_SetChannelOffset1(ADC1, HAL_ADC_PHASE_A_CHANNEL,
                          (uint16_t)(offset[0] / 16384u));
    ADC_ChannelOffset1Cmd(ADC1, ENABLE);

    ADC_SetChannelOffset2(ADC1, HAL_ADC_PHASE_B_CHANNEL,
                          (uint16_t)(offset[1] / 16384u));
    ADC_ChannelOffset2Cmd(ADC1, ENABLE);

    ADC_SetChannelOffset3(ADC1, HAL_ADC_PHASE_C_CHANNEL,
                          (uint16_t)(offset[2] / 16384u));
    ADC_ChannelOffset3Cmd(ADC1, ENABLE);

    /* Read VBUS and temperature */
    ADC_StartConversion(ADC1);
    while (!hal_read_last_vbus_temp_());

    /*
    Enable end-of-conversion interrupts and hardware triggering, then start
    converting
    */
    ADC_ITConfig(ADC1, ADC_IT_JEOS, ENABLE);
    injected_config.ADC_ExternalTrigInjecEventEdge =
        ADC_ExternalTrigInjecEventEdge_RisingEdge;
    ADC_InjectedInit(ADC1, &injected_config);
}


static bool hal_read_last_vbus_temp_() {
    /* TS_CAL_1 is the temperature sensor reading at 30 deg C */
    static uint16_t ts_cal_1 = *((volatile uint16_t*)(0x1FFFF7B8));
    /* TS_CAL_2 is the temperature sensor reading at 110 deg C */
    static uint16_t ts_cal_2 = *((volatile uint16_t*)(0x1FFFF7C2));
    static float ts_deg_c_per_lsb = (110.0f - 30.0f) /
                                    (float)(ts_cal_2 - ts_cal_1);
    float temp;

    /* Check if the last VBUS and temperature conversion is done */
    if (!ADC_GetStartConversionStatus(ADC1)) {
        /*
        Low-pass the readings if we've already taken them, otherwise seed
        the filter with the current value.
        */
        if (board_vbus_lsb_ > 0) {
            board_vbus_lsb_ = (board_vbus_lsb_ * 63 +
                               (adc_conversion_results_[0] << 7)) >> 6;
        } else {
            board_vbus_lsb_ = adc_conversion_results_[0] << 7;
        }
        temp = (float)(board_vbus_lsb_ >> 4) * hal_full_scale_voltage_v *
               (1.0f / 32768.0f);
        vbus_v_ = temp;
        if (temp > 6.0f) {
            vbus_inv_ = 32768.0f / temp;
        } else {
            vbus_inv_ = 0.0f;
        }

        if (board_temp_lsb_ > 0) {
            board_temp_lsb_ = (board_temp_lsb_ * 63 +
                               (adc_conversion_results_[1] << 7)) >> 6;
        } else {
            board_temp_lsb_ = adc_conversion_results_[1] << 7;
        }
        temp = 30.0f +
               (float)((int32_t)(board_temp_lsb_ >> 7) - (int32_t)ts_cal_1) *
               ts_deg_c_per_lsb;
        temp_degc_ = temp;

        /* Start a new conversion */
        ADC_StartConversion(ADC1);

        return true;
    } else {
        return false;
    }
}


void hal_restart(void) {
    hal_set_pwm_state(HAL_PWM_STATE_OFF);

    /* NVIC_SystemReset(); */
    __DSB();
    SCB->AIRCR = ((0x5FA << SCB_AIRCR_VECTKEY_Pos) |
                 (SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) |
                 SCB_AIRCR_SYSRESETREQ_Msk);
    __DSB();
    for (volatile bool cond = true; cond;);
}


void hal_reset(void) {
    /* Clear out state */
    pwm_state_ = HAL_PWM_STATE_OFF;
    board_vbus_lsb_ = 0;

    hal_init_sys_();
    hal_init_io_();
    hal_init_tim1_();
    hal_init_adc_();
    hal_init_dma_();
    hal_init_can_();
    hal_init_pwm_();

    /* Calibrate the current shunt sensor offsets */
    hal_run_calibration_();

