thiemar/vectorcontrol/src/stm32f302_hal.cpp
    /* Trigger an ADC conversion to start the high-frequency task */
    ADC_StartInjectedConversion(ADC1);

    /* Enable PWM generation from TIM1 */
    TIM_CtrlPWMOutputs(TIM1, ENABLE);

    /* Enable SysTick 1 kHz periodic task */
    SysTick_Config(hal_core_frequency_hz / 1000u);
    NVIC_SetPriority(SysTick_IRQn, SYSTICK_PRIORITY);

    __enable_irq();
}


void hal_set_pwm_state(enum hal_pwm_state_t state) {
    if (state == pwm_state_) {
        /* No change -- ignore */
    } else if (state == HAL_PWM_STATE_OFF) {
        /* Tri-state the drive pins to force the MOSFET drivers off */
        GPIO_Init(PORT_PHASE_SW, &PIN_PHASE_SW_DIS);
    } else if (state == HAL_PWM_STATE_LOW) {
        /* Force all outputs low */
        GPIO_ResetBits(PORT_PHASE_SW, (uint16_t)PIN_PHASE_SW_LOW.GPIO_Pin);
        GPIO_Init(PORT_PHASE_SW, &PIN_PHASE_SW_LOW);
    } else if (state == HAL_PWM_STATE_RUNNING) {
        /* Take PWM output pins out of tri-state */
        GPIO_Init(PORT_PHASE_SW, &PIN_PHASE_SW_EN);
    }

    pwm_state_ = state;
}


enum hal_status_t hal_transmit_can_message(const CANMessage& message) {
    CanTxMsg msg;
    uint8_t result;

    msg.RTR = CAN_RTR_Data;

    if (message.has_extended_id()) {
        msg.ExtId = message.get_id();
        msg.IDE = CAN_Id_Extended;
    } else {
        msg.StdId = message.get_id();
        msg.IDE = CAN_Id_Standard;
    }

    msg.DLC = (uint8_t)message.get_data(msg.Data);

    result = CAN_Transmit(CAN1, &msg);

    if (result == CAN_TxStatus_NoMailBox) {
        return HAL_STATUS_ERROR;
    } else {
        return HAL_STATUS_OK;
    }
}


float hal_get_temperature_degc(void) {
    return temp_degc_;
}


void hal_set_low_frequency_callback(hal_callback_t callback) {
    esc_assert(!callback || !low_frequency_task_);

    low_frequency_task_ = callback;
}


void hal_set_high_frequency_callback(hal_control_callback_t callback) {
    esc_assert(!callback || !high_frequency_task_);

    high_frequency_task_ = callback;
}


void hal_set_can_receive_callback(hal_can_callback_t callback) {
    esc_assert(!callback || !can_receive_task_);

    can_receive_task_ = callback;
}


void hal_set_rc_pwm_callback(hal_pwm_callback_t callback) {
    esc_assert(!callback || !pwm_receive_task_);

    pwm_receive_task_ = callback;
}

void hal_flash_protect(bool __attribute__((unused)) readonly) {
    /* TODO */
}


void hal_flash_erase(uint8_t *addr, size_t len) {
    FLASH_Status result;

    hal_set_pwm_state(HAL_PWM_STATE_OFF);

    /* Pages and lengths must be a multiple of 2048 */
    esc_assert(((uint32_t)addr & 0x7FFu) == 0);
    esc_assert(((uint32_t)len & 0x7FFu) == 0);

    FLASH_Unlock();
    while (len) {
        result = FLASH_ErasePage((uint32_t)addr);
        esc_assert(result == FLASH_COMPLETE);

        addr += 2048u;
        len -= 2048u;
    }
    FLASH_Lock();
}


void hal_flash_write(uint8_t *addr, size_t len, const uint8_t *data) {
    uint32_t word;
    FLASH_Status result;

    hal_set_pwm_state(HAL_PWM_STATE_OFF);

    /* Addresses and lengths must be 4-byte aligned */
    esc_assert(((uint32_t)addr & 0x3u) == 0);
    esc_assert(((uint32_t)len & 0x3u) == 0);

    FLASH_Unlock();
    while (len) {
        memcpy(&word, data, sizeof(uint32_t));
        result = FLASH_ProgramWord((uint32_t)addr, word);

        /*
        Ensure the operation completed successfully and the correct word was
        written.
        */
        esc_assert(result == FLASH_COMPLETE);
        esc_assert(memcmp(addr, data, sizeof(uint32_t)) == 0);

        addr += 4u;
        data += 4u;
        len -= 4u;
    }
    FLASH_Lock();
}

void hal_disable_can_transmit(void) {
    GPIO_SetBits(PORT_CAN_SILENT, (uint16_t)PIN_CAN_SILENT.GPIO_Pin);
}


void hal_enable_can_transmit(void) {
    GPIO_ResetBits(PORT_CAN_SILENT, (uint16_t)PIN_CAN_SILENT.GPIO_Pin);
}

